src/cf/InformationRegisters/КорреспонденцииСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КорреспонденцииСчетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетДт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетКт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидОперацииДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийКомплектацияНоменклатуры</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийВыдачаДенежныхДокументов</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыРегламентныхОпераций</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийОплатаПлатежнойКартой</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийРеализацияТоваров</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоступлениеДенежныхДокументов</v8:Type>
						<v8:Type>cfg:EnumRef.РазделыУчетаДляВводаОстатков</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПринятияКУчетуОсновныхСредств</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийРКО</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПКО</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийИсправленияПоступленияРеализации</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПередачаТоваров</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийСписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийКорректировкаДолга</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗакладкаДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подраздел</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаНаИТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Раздел82</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подраздел82</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Журнал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаНаИТС82</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/КорреспонденцииСчетов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// Заполнение записей регистра
//
Процедура ЗаполнитьКорреспонденцииСчетов() Экспорт

	#Если Клиент Тогда
	Состояние(НСтр("ru = 'Выполняется заполнение корреспонденций счетов'"));
#КонецЕсли

	ЗаписиКорреспонденцииСчетов = РегистрыСведений.КорреспонденцииСчетов.СоздатьНаборЗаписей();
	
	МакетыКорреспонденцииСчетов = Метаданные.РегистрыСведений.КорреспонденцииСчетов.Макеты;
	
	Для Каждого МакетКорреспонденцииСчетов Из МакетыКорреспонденцииСчетов Цикл
		
		Если МакетКорреспонденцииСчетов.ТипМакета <> Метаданные.СвойстваОбъектов.ТипМакета.ТекстовыйДокумент Тогда
			Продолжить;
		КонецЕсли;
		
	Макет = РегистрыСведений.КорреспонденцииСчетов.ПолучитьМакет(МакетКорреспонденцииСчетов.Имя).ПолучитьТекст();	
	КорреспонденцииСчетовТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(Макет).Данные;
		
	Для Каждого СтрокаТаблицы Из КорреспонденцииСчетовТаблица Цикл
		
		ЗаписьКорреспонденцииСчетов = ЗаписиКорреспонденцииСчетов.Добавить();
		
		ЗаписьКорреспонденцииСчетов.Идентификатор = Строка (Новый УникальныйИдентификатор);
		ЗаписьКорреспонденцииСчетов.СчетДт = СтрокаТаблицы.Дт;
		ЗаписьКорреспонденцииСчетов.СчетКт = СтрокаТаблицы.Кт;
		ЗаписьКорреспонденцииСчетов.Содержание 			= СтрокаТаблицы.Содержание;
		ЗаписьКорреспонденцииСчетов.ИмяДокумента 		= СтрокаТаблицы.ИмяДокумента;
		ЗаписьКорреспонденцииСчетов.ТипДокумента 		= СтрокаТаблицы.ТипДокумента;
		ЗаписьКорреспонденцииСчетов.ЗакладкаДокумента 	= СтрокаТаблицы.ЗакладкаДокумента;
		ЗаписьКорреспонденцииСчетов.Раздел				= СтрокаТаблицы.Раздел;
		ЗаписьКорреспонденцииСчетов.Раздел82			= СтрокаТаблицы.Раздел82;
		ЗаписьКорреспонденцииСчетов.Подраздел			= СтрокаТаблицы.Подраздел;
		ЗаписьКорреспонденцииСчетов.Подраздел82			= СтрокаТаблицы.Подраздел82;
		ЗаписьКорреспонденцииСчетов.Журнал				= СтрокаТаблицы.Журнал;
		ЗаписьКорреспонденцииСчетов.СсылкаНаИТС 		= СтрокаТаблицы.СсылкаНаИТС;
		ЗаписьКорреспонденцииСчетов.СсылкаНаИТС82 		= СтрокаТаблицы.СсылкаНаИТС82;
		Если ЗначениеЗаполнено(СтрокаТаблицы.ВидОперацииДокумента) Тогда
			ЗаписьКорреспонденцииСчетов.ВидОперацииДокумента = ПолучитьВидОперацииДокументаПоСинониму(СтрокаТаблицы.ИмяДокумента, СтрокаТаблицы.ВидОперацииДокумента);
		КонецЕсли;
		
	КонецЦикла;
КонецЦикла;
	ЗаписиКорреспонденцииСчетов.Записать();
	
	#Если Клиент Тогда
		Состояние(НСтр("ru = 'Заполнение корреспонденций счетов выполнено'"));
	#КонецЕсли
	
КонецПроцедуры

Функция ПолучитьВидОперацииДокументаПоСинониму(ИмяДокумента, СинонимВидаОперации)
	
	Результат = Неопределено;
	
	ИмяРеквизита = ?(ИмяДокумента = "ВводНачальныхОстатков", "РазделУчета", "ВидОперации");
	
	Перечисление = Метаданные.Документы[ИмяДокумента].Реквизиты[ИмяРеквизита].Тип.ПривестиЗначение().Метаданные();
	
	ИмяЗначенияПеречисления = "";
	Для каждого ЗначениеПеречисления Из Перечисление.ЗначенияПеречисления Цикл
		Если ЗначениеПеречисления.Синоним = СинонимВидаОперации Тогда
			Результат = Перечисления[Перечисление.Имя][ЗначениеПеречисления.Имя];
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли
